name: "ensemble"
platform: "ensemble"

input [
  {
    name: "TEXT"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]
output [
  {
    name: "EMBEDDINGS_ONNX"
    data_type: TYPE_FP32
    dims: [ -1 ]
  },
  {
    name: "EMBEDDINGS_FP32"
    data_type: TYPE_FP32
    dims: [ -1 ]
  },
  {
    name: "EMBEDDINGS_FP16"
    data_type: TYPE_FP32
    dims: [ -1 ]
  },
  {
    name: "EMBEDDINGS_INT8"
    data_type: TYPE_FP32
    dims: [ -1 ]
  },
  {
    name: "EMBEDDINGS_BEST"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "tokenizer"
      model_version: -1
      input_map {
        key: "TEXT"
        value: "TEXT"
      }
      output_map {
        key: "INPUT_IDS"
        value: "INPUT_IDS"
      }
      output_map {
        key: "ATTENTION_MASK"
        value: "ATTENTION_MASK"
      }
    },
    {
      model_name: "model_ONNX"
      model_version: -1
      input_map {
        key: "INPUT_IDS"
        value: "INPUT_IDS"
      }
      input_map {
        key: "ATTENTION_MASK"
        value: "ATTENTION_MASK"
      }
      output_map {
        key: "EMBEDDINGS"
        value: "EMBEDDINGS_ONNX"
      }
    },
    {
      model_name: "model_TRT_FP32"
      model_version: -1
      input_map {
        key: "INPUT_IDS"
        value: "INPUT_IDS"
      }
      input_map {
        key: "ATTENTION_MASK"
        value: "ATTENTION_MASK"
      }
      output_map {
        key: "EMBEDDINGS"
        value: "EMBEDDINGS_FP32"
      }
    },
    {
      model_name: "model_TRT_FP16"
      model_version: -1
      input_map {
        key: "INPUT_IDS"
        value: "INPUT_IDS"
      }
      input_map {
        key: "ATTENTION_MASK"
        value: "ATTENTION_MASK"
      }
      output_map {
        key: "EMBEDDINGS"
        value: "EMBEDDINGS_FP16"
      }
    },
    {
      model_name: "model_TRT_INT8"
      model_version: -1
      input_map {
        key: "INPUT_IDS"
        value: "INPUT_IDS"
      }
      input_map {
        key: "ATTENTION_MASK"
        value: "ATTENTION_MASK"
      }
      output_map {
        key: "EMBEDDINGS"
        value: "EMBEDDINGS_INT8"
      }
    },
    {
      model_name: "model_TRT_BEST"
      model_version: -1
      input_map {
        key: "INPUT_IDS"
        value: "INPUT_IDS"
      }
      input_map {
        key: "ATTENTION_MASK"
        value: "ATTENTION_MASK"
      }
      output_map {
        key: "EMBEDDINGS"
        value: "EMBEDDINGS_BEST"
      }
    }
  ]
}

